alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Devices/NRF24L01/NRF24L01.cpp
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_cd(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_CD;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p0(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P0;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p0(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P0;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p1(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P1;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p1(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P1;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p2(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P2;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p2(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P2;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p3(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P3;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p3(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P3;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p4(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P4;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p4(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P4;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_addr_p5(const uint8_t*addr,uint8_t length){
    // SETUP_AW is important here since it defines address length
    // Add error checking in the future //Fix
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_ADDR_P5;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_addr_p5(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_ADDR_P5;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_tx_addr(const uint8_t*addr,uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_TX_ADDR;
    memcpy(_transaction_data.txBuffer+1,addr,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_tx_addr(uint8_t length){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_TX_ADDR;
    memset(_transaction_data.txBuffer+1,NRF_CMD_NOP,length);
    _transaction_data.txLength=length+1;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p0(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P0;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p0(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P0;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p1(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P1;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p1(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P1;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;
    
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p2(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P2;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

