alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Devices/NRF24L01/NRF24L01.cpp
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p2(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P2;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;
    
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p3(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P3;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p3(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P3;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;
    
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p4(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P4;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p4(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P4;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;
    
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_rx_pw_p5(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_RX_PW_P5;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_rx_pw_p5(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_RX_PW_P5;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;
    
    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_fifo_status(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_FIFO_STATUS;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_fifo_status(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_FIFO_STATUS;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_dynpd(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_DYNPD;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_dynpd(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_DYNPD;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::write_reg_feature(uint8_t flags){
    _transaction_data.txBuffer[0]=NRF_CMD_W_REGISTER|NRF_REG_FEATURE;
    _transaction_data.txBuffer[1]=flags;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_reg_feature(){
    _transaction_data.txBuffer[0]=NRF_CMD_R_REGISTER|NRF_REG_FEATURE;
    _transaction_data.txBuffer[1]=NRF_CMD_NOP;
    _transaction_data.txLength=2;

    return spi1_dma_enq_data(&_transaction_data);
}

bool NRF24L01::read_rx_payload(uint8_t length){
    return true;
}

bool NRF24L01::write_tx_payload(uint8_t length){
    return true;
}

bool NRF24L01::flush_tx(){
    return true;
}

bool NRF24L01::flush_rx(){
    return true;
}

bool NRF24L01::reuse_tx_pl(){
    return true;
}

bool NRF24L01::activate(uint8_t flags){
    return true;
}

NRF24L01_REGS NRF24L01::get_register_values()const{
    return _regs;
}


// Test functions

extern SPI_HandleTypeDef hspi1;

void nrf24l01_display_all_registers();

extern "C" void nrf24l01_init1(void){
    // Dobra na razie pierwsza proba bedzie taka, ze to stm32 bedzie nadawac
    // Na arduino tymczasem zrobie polling albo event driven wypisywanie danych na uart w postaci surowej paczki
    // Detale sa nieistotne, istotne jest potwierdzenie konfiguracji i poprawnosci odbieranych przez Arduino danych
    // W STM'ie zrobimy sobie petle nadawcza co np. 1 sekunde i na arduino zobaczymy czy zadziała
    // Jeżeli zadziała to ustawimy do wysłania np. 1000 pakietów i określimy procent utraconych pakietów w zależności
    // Od odległości między nadajnikiem a odbiornikiem.
    // Pozwoli to na sprawdzenie czy jest dobre spasowanie anten na własnym PCB.
    // Ustawienia radia: (idą po kolei rejestrami)
    // STM/AVR CONFIG        NRF_BIT_EN_CRC|NRF_BIT_CRCO|NRF_BIT_PWR_UP
    //     AVR EN_AA         NRF_BIT_ENAA_P0
    // STM/AVR SETUP_AW      NRF_BIT_AW1|NRF_BIT_AW0
    // STM/AVR SETUP_RETR    NRF_BIT_ARD5|NRF_BIT_ARC1|NRF_BIT_ARC0
    // STM/AVR RF_CH         NRF_BIT_RF_CH5
    // STM/AVR RF_SETUP      NRF_BIT_RF_DR|NRF_BIT_RF_PWR2|NRF_BIT_RF_PWR1
    //     AVR RX_ADDR_P0    0xFE FE FE FE FE
    // STM/AVR TX_ADDR       0xFE FE FE FE FE
    //     AVR RX_PW_P0      1<<5 (32 bajty)
    //
    // A tak teraz do zrobienia zostalo napisanie programu na Arduino Mega i sprobowac to skomunikowac
    // Jakkolwiek skomunikowac, bez przerwan bez czegokolwiek, jedynie sprawdzić % utraconych pakietów
    // w zależności od odległości, parametrem będzie prędkość transmisji 1 Mbps lub 2 Mbps
    // A na Arduino dodać LCD'ka żeby wyświetlić ten procent na koniec

    uint8_t operationTx[33]={0};
    uint8_t operationRx[33]={0};
    const uint8_t address[5]={0xFE,0xFE,0xFE,0xFE,0xFE};

    typedef struct NRF_SETTINGS{
        uint8_t config;
        uint8_t setup_aw;
        uint8_t setup_retr;
        uint8_t rf_ch;
        uint8_t rf_setup;
        uint8_t tx_addr[5];
    }NRF_SETTINGS;

    NRF24L01 nrf24l01(nullptr,0,GPIOB,GPIO_PIN_0,nullptr,0);

    nrf24l01.attach_rx_buffer(operationRx,33);
    nrf24l01.attach_tx_buffer(operationTx,33);

    NRF_SETTINGS nrf_wrote_settings{
        NRF_BIT_EN_CRC|NRF_BIT_CRCO|NRF_BIT_PWR_UP,
        NRF_BIT_AW1|NRF_BIT_AW0,
        NRF_BIT_ARD5|NRF_BIT_ARC1|NRF_BIT_ARC0,
        NRF_BIT_RF_CH5,
        NRF_BIT_RF_DR|NRF_BIT_RF_PWR2|NRF_BIT_RF_PWR1,
        {address[0],address[1],address[2],address[3],address[4]}
    };

    NRF_SETTINGS nrf_read_settings{0};
    UNUSED(nrf_read_settings);
    UNUSED(nrf_wrote_settings);

    HAL_GPIO_WritePin(GPIOC,GPIO_PIN_15,GPIO_PIN_RESET);
    HAL_Delay(100);
// Note that there should be retry logic when adding SPI data to SPI Queue, but for now omitted
    //nrf24l01.write_reg_config(NRF_BIT_PWR_UP);
        HAL_Delay(100);
    nrf24l01.write_reg_config(NRF_BIT_PWR_UP);
    HAL_Delay(100);
    nrf24l01.write_reg_config(NRF_BIT_EN_CRC|NRF_BIT_CRCO|NRF_BIT_PWR_UP);
    HAL_Delay(100);
    nrf24l01.write_reg_setup_aw(NRF_BIT_AW1|NRF_BIT_AW0);
        HAL_Delay(100);
    nrf24l01.write_reg_setup_retr(NRF_BIT_ARD5|NRF_BIT_ARC1|NRF_BIT_ARC0);
        HAL_Delay(100);
    nrf24l01.write_reg_rf_ch(NRF_BIT_RF_CH5);
        HAL_Delay(100);
    nrf24l01.write_reg_rf_setup(NRF_BIT_RF_DR|NRF_BIT_RF_PWR2|NRF_BIT_RF_PWR1);
        HAL_Delay(100);
    nrf24l01.write_reg_tx_addr(address,5);
        HAL_Delay(100);
    nrf24l01.write_reg_rx_addr_p0(address,5);
        HAL_Delay(100);
// Verify settings
    nrf24l01.read_reg_config();
    HAL_Delay(100);
    nrf_read_settings.config=operationRx[1];
    nrf24l01.read_reg_setup_aw();
        HAL_Delay(100);
    nrf_read_settings.setup_aw=operationRx[1];
    nrf24l01.read_reg_setup_retr();
        HAL_Delay(100);
    nrf_read_settings.setup_retr=operationRx[1];
    nrf24l01.read_reg_rf_ch();
        HAL_Delay(100);
    nrf_read_settings.rf_ch=operationRx[1];
    nrf24l01.read_reg_rf_setup();
        HAL_Delay(100);
    nrf_read_settings.rf_setup=operationRx[1];
    nrf24l01.read_reg_tx_addr(5);
        HAL_Delay(100);
    memcpy(nrf_read_settings.tx_addr,operationRx+1,5);
// Flush TX
    operationTx[0]=NRF_CMD_FLUSH_TX;
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET);
        HAL_SPI_TransmitReceive(&hspi1,operationTx,operationRx,1,HAL_MAX_DELAY);
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);    

nrf24l01_display_all_registers();

    operationTx[0]=NRF_CMD_W_TX_PAYLOAD;
    memset(operationTx+1,0xAA,32);
    for(int i=0;i<1000;i++){
        operationTx[0]=NRF_CMD_W_TX_PAYLOAD;
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET);
        HAL_SPI_TransmitReceive(&hspi1,operationTx,operationRx,33,HAL_MAX_DELAY);
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);
        //HAL_Delay(20);
        HAL_GPIO_WritePin(GPIOC,GPIO_PIN_15,GPIO_PIN_SET);
        //HAL_Delay(20);
        //HAL_GPIO_WritePin(GPIOC,GPIO_PIN_15,GPIO_PIN_RESET);        
        HAL_Delay(60);

        operationTx[0]=NRF_CMD_W_REGISTER|NRF_REG_STATUS;
        operationTx[1]=NRF_BIT_TX_DS|NRF_BIT_MAX_RT;
        
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET);
        HAL_SPI_TransmitReceive(&hspi1,operationTx,operationRx,2,HAL_MAX_DELAY);
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);
        operationTx[0]=NRF_CMD_W_REGISTER|NRF_REG_STATUS;
        operationTx[1]=0x30;

        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET);
        HAL_SPI_TransmitReceive(&hspi1,operationTx,operationRx,2,HAL_MAX_DELAY);
        HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);
    }
}

