alan-kudelko/TrinityTrack6000/MainControlBoard/STM32/STM32G473CET6/Devices/NRF24L01/NRF24L01.cpp
extern "C" void callback(void){
    
}

extern "C" void nrf24l01_test(void){
    // Temporary test function
    uint8_t dataRx[32];
    uint8_t dataTx[32];

    memset(dataTx,0,sizeof(dataTx));
    memset(dataRx,0,sizeof(dataRx));

    dataTx[0]=0xff; // NOP
    dataTx[1]=0xff; // NOP
    
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET);
    HAL_Delay(1);

    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET); // Select NRF24L01
    HAL_SPI_TransmitReceive(&hspi1,dataTx,dataRx,2,HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET); // Deselect NRF24L01
    // Ostatnim razem przyszła wartość 14 czyli 0x0e jest to wartosc poprawna

    // Teraz odczyt konkretnego rejestru czyli config
    // 000A AAAA w miejsce A wstawiamy 5 bitowy adres rejestru

    // Rejestr config to 0x00
    dataTx[0]=0x00;
    dataTx[1]=0x00;

    memset(dataRx,0,sizeof(dataRx));
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_RESET); // Select NRF24L01
    HAL_SPI_TransmitReceive(&hspi1,dataTx,dataRx,2,HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOB,GPIO_PIN_0,GPIO_PIN_SET); // Deselect NRF24L01

    // Teraz testy z moim driverem SPI1_DMA
    memset(dataRx,0,sizeof(dataRx));
    hspi_data test_data;
    test_data.callbackFn=callback;
    test_data.flags=HSPI_FLAG_FULL_DUPLEX;
    test_data.gpio_port=GPIOB;
    test_data.gpio_pin=GPIO_PIN_0;
    test_data.txBuffer=dataTx;
    test_data.rxBuffer=dataRx;
    test_data.txLength=2;
    test_data.rxLength=2;

    spi1_dma_enq_data(&test_data);

    HAL_Delay(10);
// Testy API klasy NRF24L01 - warto tutaj dodać, że bufory muszą zostać zapewnione przez funkcję wywołującą lub przez proces wywołujący
// Potrzebny jest roboczy bufor rx i tx o długości 33 bajtów
// Dodatkowo bufor nadawczy i odbiorczy również o długości 33 bajtów

// Registers for read and write operations (modified inside the NRF24L01 object)
    uint8_t operationTx[33]={0};
    uint8_t operationRx[33]={0};

    NRF24L01 nrf24l01(nullptr,0,GPIOB,GPIO_PIN_0,nullptr,0);

    nrf24l01.attach_rx_buffer(operationRx,33);
    nrf24l01.attach_tx_buffer(operationTx,33);

    HAL_GPIO_WritePin(GPIOC,GPIO_PIN_15,GPIO_PIN_RESET);

    nrf24l01.read_reg_status();
    HAL_Delay(100);
    nrf24l01.write_reg_status(NRF_BIT_RX_DR|NRF_BIT_TX_DS);
    HAL_Delay(100);
    nrf24l01.read_reg_status();

    HAL_Delay(100);

}

extern UART_HandleTypeDef huart1;

void nrf24l01_display_all_registers(){
    // Function to display all register values to serial terminal
    // Used only during testing of the wireless communication
    typedef struct NRF24L01_REG{
        uint8_t config;
        uint8_t en_aa;
        uint8_t en_rxaddr;
        uint8_t setup_aw;
        uint8_t setup_retr;
        uint8_t rf_ch;
        uint8_t rf_setup;
        uint8_t status;
        uint8_t observe_tx;
        uint8_t cd;
        uint8_t rx_addr_p0[5];
        uint8_t rx_addr_p1[5];
        uint8_t rx_addr_p2[5];
        uint8_t rx_addr_p3[5];
        uint8_t rx_addr_p4[5];
        uint8_t rx_addr_p5[5];
        uint8_t tx_addr[5];
        uint8_t rx_pw_p0;
        uint8_t rx_pw_p1;
        uint8_t rx_pw_p2;
        uint8_t rx_pw_p3;
        uint8_t rx_pw_p4;
        uint8_t rx_pw_p5;
        uint8_t fifo_status;
        uint8_t dynpd;
        uint8_t feature;
    }NRF24L01_REG;

    NRF24L01_REG nrf24l01_reg;

    UNUSED(nrf24l01_reg);

    uint8_t operationTx[33]={0};
    uint8_t operationRx[33]={0};

    char buffer[33]{0};
    UNUSED(buffer);

    NRF24L01 nrf24l01(nullptr,0,GPIOB,GPIO_PIN_0,nullptr,0);
    nrf24l01.attach_rx_buffer(operationRx,33);
    nrf24l01.attach_tx_buffer(operationTx,33);
// Reading data from NRF24L01 and assigning values to the struct
// CONFIG
    nrf24l01.read_reg_config();
    HAL_Delay(50);
    nrf24l01_reg.config=operationRx[1];
// ENAA
    nrf24l01.read_reg_en_aa();
    HAL_Delay(50);
    nrf24l01_reg.en_aa=operationRx[1];
// EN_RXADDR
    nrf24l01.read_reg_en_rxAddr();
    HAL_Delay(50);
    nrf24l01_reg.en_rxaddr=operationRx[1];
// SETUP_AW
    nrf24l01.read_reg_setup_aw();
    HAL_Delay(50);
    nrf24l01_reg.setup_aw=operationRx[1];
// SETUP_RETR
    nrf24l01.read_reg_setup_retr();
    HAL_Delay(50);
    nrf24l01_reg.setup_retr=operationRx[1];
// RF_CH
    nrf24l01.read_reg_rf_ch();
    HAL_Delay(50);
    nrf24l01_reg.rf_ch=operationRx[1];
// RF_SETUP
    nrf24l01.read_reg_rf_setup();
    HAL_Delay(50);
    nrf24l01_reg.rf_setup=operationRx[1];
// STATUS
    nrf24l01.read_reg_status();
    HAL_Delay(50);
    nrf24l01_reg.status=operationRx[1];
// OBSERVE_TX
    nrf24l01.read_reg_observe_tx();
    HAL_Delay(50);
    nrf24l01_reg.observe_tx=operationRx[1];
// CD
    nrf24l01.read_reg_cd();
    HAL_Delay(50);
    nrf24l01_reg.cd=operationRx[1];
// RX_ADDR_P0
    nrf24l01.read_reg_rx_addr_p0(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p0,operationRx+1,5);
// RX_ADDR_P1
    nrf24l01.read_reg_rx_addr_p1(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p1,operationRx+1,5);
// RX_ADDR_P2
    nrf24l01.read_reg_rx_addr_p2(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p2,operationRx+1,5);
// RX_ADDR_P3
    nrf24l01.read_reg_rx_addr_p3(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p3,operationRx+1,5);
// RX_ADDR_P4
    nrf24l01.read_reg_rx_addr_p4(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p4,operationRx+1,5);
// RX_ADDR_P5
    nrf24l01.read_reg_rx_addr_p5(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.rx_addr_p5,operationRx+1,5);
// TX_ADDR
    nrf24l01.read_reg_tx_addr(5);
    HAL_Delay(50);
    memcpy(nrf24l01_reg.tx_addr,operationRx+1,5);
// RX_PW_P0
    nrf24l01.read_reg_rx_pw_p0();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p0=operationRx[1];
// RX_PW_P1
    nrf24l01.read_reg_rx_pw_p1();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p1=operationRx[1];
// RX_PW_P2
    nrf24l01.read_reg_rx_pw_p2();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p2=operationRx[1];
// RX_PW_P3
    nrf24l01.read_reg_rx_pw_p3();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p3=operationRx[1];
// RX_PW_P4
    nrf24l01.read_reg_rx_pw_p4();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p4=operationRx[1];
// RX_PW_P5
    nrf24l01.read_reg_rx_pw_p5();
    HAL_Delay(50);
    nrf24l01_reg.rx_pw_p5=operationRx[1];
// FIFO_STATUS
    nrf24l01.read_reg_fifo_status();
    HAL_Delay(50);
    nrf24l01_reg.fifo_status=operationRx[1];
// DYNPD
    nrf24l01.read_reg_dynpd();
    HAL_Delay(50);
    nrf24l01_reg.dynpd=operationRx[1];
// FEATURE
    nrf24l01.read_reg_feature();
    HAL_Delay(50);
    nrf24l01_reg.feature=operationRx[1];
    //HAL_UART_Transmit(&huart1,(uint8_t*)buffer,8,HAL_MAX_DELAY);

}